# -*- coding: utf-8 -*-
# -*- mode: org -*-
#+startup: beamer overview indent
#+LANGUAGE: pt-br
#+TAGS: noexport(n)
#+EXPORT_EXCLUDE_TAGS: noexport
#+EXPORT_SELECT_TAGS: export

#+Title: Algoritmos
#+Subtitle: *INF01202*
#+Author: Prof. Lucas Mello Schnorr
#+Date: \copyleft

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [xcolor=dvipsnames]
#+OPTIONS: title:nil H:1 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel.tex}
#+LATEX_HEADER: \usepackage{amsmath}
#+LATEX_HEADER: \usepackage{systeme}

#+latex: \newcommand{\mytitle}{Referências e Ponteiros}
#+latex: \mytitleslide

* Motivação: exemplo ~a26-troca.c~

#+attr_latex: :options fontsize=\scriptsize
#+BEGIN_SRC C :tangle e/a26-troca.c
#include <stdio.h>
void troca (int x, int y) {
  int temp = x;
  x = y;
  y = temp;
  return;
}
int main() {
  int a = 5;
  int b = 10;
  printf("#1: a = %d, b = %d\n", a, b);
  troca(a, b); //chamada de função, passagem por valor (é feita uma cópia)
  printf("#2: a = %d, b = %d\n", a, b);
  return 0;
}
#+END_SRC

O que é impresso em #2?

#+begin_src shell :results output :exports both :dir e
gcc a25-troca.c; ./a.out
#+end_src

#+RESULTS:
: #1 a = 5, b = 10
: #2 a = 5, b = 10

Como fazer então? \to Utilizar método de *passagem por referência*

* Exemplo #3: Aritmética de ponteiros

O valor considerado é o tamanho do tipo do ponteiro. Exemplo, ao somar 1
no ponteiro, será somado o tamanho do tipo do ponteiro (4 se ~int~).

#+BEGIN_SRC C :tangle e/a26-aritmetica.c :results output :exports both
#include <stdio.h>
int main() {
  int *nova;       // variável normal do tipo int que é um ponteiro
  int *terra;      // variável normal do tipo int que é um ponteiro
  int *centauri;   // variável normal do tipo int que é um ponteiro
  int alpha = 200; // variável normal do tipo int

  nova = &alpha;   // o ponteiro nova aponta para o endereço de alpha
  terra = nova;    // o ponteiro terra também aponta para onde nova aponta

  printf("nova     (endereço %p): %p\n", &nova, nova);
  printf("terra    (endereço %p): %p\n", &terra, terra);
  centauri = terra + 1; // incrementar em 1 o valor do ponteiro terra
  printf("centauri (endereço %p): %p\n", &centauri, centauri);
  return 0;
}
#+END_SRC

#+RESULTS:
: nova     (endereço 0x7ffd4d4199b8): 0x7ffd4d4199a4
: terra    (endereço 0x7ffd4d4199b0): 0x7ffd4d4199a4
: centauri (endereço 0x7ffd4d4199a8): 0x7ffd4d4199a8


#  //Vamos trabalhar com variáveis normais do tipo int (que não são ponteiros)
#  int x = terra;
#  int y = terra + 1;
#  int z = x + 1;
#  printf("x (valor de terra)     = %d\n"
#         "y (valor de terra + 1) = %d\n"
#         "z (valor de x + 1)     = %d\n", x, y, z);
#  return 0;
* Cuidados essenciais: problemas comuns @@latex:{\scriptsize@@ (~a26-tipo_errado.c~) @@latex:}@@

Tipos incompatíveis: ~p~ é um ponteiro para inteiros, logo não pode
apontar para uma variável do tipo ~float~.

#+BEGIN_SRC C :tangle e/a26-tipo_errado.c
#include <stdio.h>
int main() {
  float x = 100;
  int *p;

  p = &x;

  printf("%p\n", p);
  return 0;
}
#+END_SRC

#+begin_src shell :results output :dir e :exports both
gcc -Wall a26-tipo_errado.c 2>&1
#+end_src

#+RESULTS:
: a26-tipo_errado.c: In function ‘main’:
: a26-tipo_errado.c:6:5: warning: assignment to ‘int *’ from incompatible pointer type ‘float *’ [-Wincompatible-pointer-types]
:    p = &x;
:      ^

* Passagem por referência ~a26-troca-ponteiro.c~

#+attr_latex: :options fontsize=\scriptsize
#+BEGIN_SRC C :tangle e/a26-troca-ponteiro.c
#include <stdio.h>
void troca (int *x, int *y) {
  int temp = *x;
  *x = *y;
  *y = temp;
  return;
}
int main() {
  int a = 5;
  int b = 10;
  printf("#1: a = %d, b = %d\n", a, b);
  troca(&a, &b); //chamada de função, passagem por valor (é feita uma cópia)
  printf("#2: a = %d, b = %d\n", a, b);
  return 0;
}
#+END_SRC

O que é impresso em #2?

#+begin_src shell :results output :exports both :dir e
gcc a26-troca-ponteiro.c; ./a.out
#+end_src

#+RESULTS:
: #1: a = 5, b = 10
: #2: a = 10, b = 5

